levizh/rt-thread/bsp/hc32/ev_hc32f4a2_lqfp176/board/board_config.h
        #define ETH_MII_TX_CLK_PORT     (GPIO_PORT_B)
        #define ETH_MII_TX_CLK_PIN      (GPIO_PIN_06)
        #define ETH_MII_TX_CLK_FUNC     (GPIO_FUNC_11)

        #define ETH_MII_TX_EN_PORT      (GPIO_PORT_G)
        #define ETH_MII_TX_EN_PIN       (GPIO_PIN_11)
        #define ETH_MII_TX_EN_FUNC      (GPIO_FUNC_11)

        #define ETH_MII_TXD0_PORT       (GPIO_PORT_G)
        #define ETH_MII_TXD0_PIN        (GPIO_PIN_13)
        #define ETH_MII_TXD0_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_TXD1_PORT       (GPIO_PORT_G)
        #define ETH_MII_TXD1_PIN        (GPIO_PIN_14)
        #define ETH_MII_TXD1_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_TXD2_PORT       (GPIO_PORT_B)
        #define ETH_MII_TXD2_PIN        (GPIO_PIN_09)
        #define ETH_MII_TXD2_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_TXD3_PORT       (GPIO_PORT_B)
        #define ETH_MII_TXD3_PIN        (GPIO_PIN_08)
        #define ETH_MII_TXD3_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_RX_CLK_PORT     (GPIO_PORT_A)
        #define ETH_MII_RX_CLK_PIN      (GPIO_PIN_01)
        #define ETH_MII_RX_CLK_FUNC     (GPIO_FUNC_11)

        #define ETH_MII_RX_DV_PORT      (GPIO_PORT_A)
        #define ETH_MII_RX_DV_PIN       (GPIO_PIN_07)
        #define ETH_MII_RX_DV_FUNC      (GPIO_FUNC_11)

        #define ETH_MII_RXD0_PORT       (GPIO_PORT_C)
        #define ETH_MII_RXD0_PIN        (GPIO_PIN_04)
        #define ETH_MII_RXD0_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_RXD1_PORT       (GPIO_PORT_C)
        #define ETH_MII_RXD1_PIN        (GPIO_PIN_05)
        #define ETH_MII_RXD1_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_RXD2_PORT       (GPIO_PORT_B)
        #define ETH_MII_RXD2_PIN        (GPIO_PIN_00)
        #define ETH_MII_RXD2_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_RXD3_PORT       (GPIO_PORT_B)
        #define ETH_MII_RXD3_PIN        (GPIO_PIN_01)
        #define ETH_MII_RXD3_FUNC       (GPIO_FUNC_11)

        #define ETH_MII_RX_ER_PORT      (GPIO_PORT_I)
        #define ETH_MII_RX_ER_PIN       (GPIO_PIN_10)
        #define ETH_MII_RX_ER_FUNC      (GPIO_FUNC_11)

        #define ETH_MII_CRS_PORT        (GPIO_PORT_H)
        #define ETH_MII_CRS_PIN         (GPIO_PIN_02)
        #define ETH_MII_CRS_FUNC        (GPIO_FUNC_11)

        #define ETH_MII_COL_PORT        (GPIO_PORT_H)
        #define ETH_MII_COL_PIN         (GPIO_PIN_03)
        #define ETH_MII_COL_FUNC        (GPIO_FUNC_11)
    #endif
#endif

/************************ SDIOC port **********************/
#if defined(BSP_USING_SDIO1)
    #define SDIOC1_CK_PORT                  (GPIO_PORT_C)
    #define SDIOC1_CK_PIN                   (GPIO_PIN_12)
    #define SDIOC1_CK_FUNC                  (GPIO_FUNC_9)

    #define SDIOC1_CMD_PORT                 (GPIO_PORT_D)
    #define SDIOC1_CMD_PIN                  (GPIO_PIN_02)
    #define SDIOC1_CMD_FUNC                 (GPIO_FUNC_9)

    #define SDIOC1_D0_PORT                  (GPIO_PORT_B)
    #define SDIOC1_D0_PIN                   (GPIO_PIN_07)
    #define SDIOC1_D0_FUNC                  (GPIO_FUNC_9)

    #define SDIOC1_D1_PORT                  (GPIO_PORT_A)
    #define SDIOC1_D1_PIN                   (GPIO_PIN_08)
    #define SDIOC1_D1_FUNC                  (GPIO_FUNC_9)

    #define SDIOC1_D2_PORT                  (GPIO_PORT_C)
    #define SDIOC1_D2_PIN                   (GPIO_PIN_10)
    #define SDIOC1_D2_FUNC                  (GPIO_FUNC_9)

    #define SDIOC1_D3_PORT                  (GPIO_PORT_B)
    #define SDIOC1_D3_PIN                   (GPIO_PIN_05)
    #define SDIOC1_D3_FUNC                  (GPIO_FUNC_9)
#endif

/************************ SDRAM port **********************/
#if defined(BSP_USING_SDRAM)
    #define SDRAM_CKE_PORT                  (GPIO_PORT_C)   /* PC03 - EXMC_ALE */
    #define SDRAM_CKE_PIN                   (GPIO_PIN_03)
    #define SDRAM_CKE_FUNC                  (GPIO_FUNC_12)

    #define SDRAM_CLK_PORT                  (GPIO_PORT_G)   /* PD03 - EXMC_CLK */
    #define SDRAM_CLK_PIN                   (GPIO_PIN_08)
    #define SDRAM_CLK_FUNC                  (GPIO_FUNC_12)

    #define SDRAM_DQM0_PORT                 (GPIO_PORT_E)   /* PE00 - EXMC_CE4 */
    #define SDRAM_DQM0_PIN                  (GPIO_PIN_00)
    #define SDRAM_DQM0_FUNC                 (GPIO_FUNC_12)
    #define SDRAM_DQM1_PORT                 (GPIO_PORT_E)   /* PE01 - EXMC_CE5 */
    #define SDRAM_DQM1_PIN                  (GPIO_PIN_01)
    #define SDRAM_DQM1_FUNC                 (GPIO_FUNC_12)

    #define SDRAM_BA0_PORT                  (GPIO_PORT_D)   /* PD11 - EXMC_ADD16 */
    #define SDRAM_BA0_PIN                   (GPIO_PIN_11)
    #define SDRAM_BA0_FUNC                  (GPIO_FUNC_12)
    #define SDRAM_BA1_PORT                  (GPIO_PORT_D)   /* PD12 - EXMC_ADD17 */
    #define SDRAM_BA1_PIN                   (GPIO_PIN_12)
    #define SDRAM_BA1_FUNC                  (GPIO_FUNC_12)

    #define SDRAM_CS_PORT                   (GPIO_PORT_G)   /* PG09 - EXMC_CE1 */
    #define SDRAM_CS_PIN                    (GPIO_PIN_09)
    #define SDRAM_CS_FUNC                   (GPIO_FUNC_12)

    #define SDRAM_RAS_PORT                  (GPIO_PORT_F)   /* PF11 - EXMC_OE */
    #define SDRAM_RAS_PIN                   (GPIO_PIN_11)
    #define SDRAM_RAS_FUNC                  (GPIO_FUNC_12)

    #define SDRAM_CAS_PORT                  (GPIO_PORT_G)   /* PG15 - EXMC_BAA */
    #define SDRAM_CAS_PIN                   (GPIO_PIN_15)
    #define SDRAM_CAS_FUNC                  (GPIO_FUNC_12)

    #define SDRAM_WE_PORT                   (GPIO_PORT_C)   /* PC00 - EXMC_WE */
    #define SDRAM_WE_PIN                    (GPIO_PIN_00)
    #define SDRAM_WE_FUNC                   (GPIO_FUNC_12)

    #define SDRAM_ADD0_PORT                 (GPIO_PORT_F)   /* PF00 - EXMC_ADD0 */
    #define SDRAM_ADD0_PIN                  (GPIO_PIN_00)
    #define SDRAM_ADD0_FUNC                 (GPIO_FUNC_12)

    #define SDRAM_ADD1_PORT                 (GPIO_PORT_F)   /* PF01 - EXMC_ADD1 */
    #define SDRAM_ADD1_PIN                  (GPIO_PIN_01)
    #define SDRAM_ADD1_FUNC                 (GPIO_FUNC_12)

    #define SDRAM_ADD2_PORT                 (GPIO_PORT_F)   /* PF02 - EXMC_ADD2 */
    #define SDRAM_ADD2_PIN                  (GPIO_PIN_02)
    #define SDRAM_ADD2_FUNC                 (GPIO_FUNC_12)

    #define SDRAM_ADD3_PORT                 (GPIO_PORT_F)   /* PF03 - EXMC_ADD3 */
    #define SDRAM_ADD3_PIN                  (GPIO_PIN_03)
    #define SDRAM_ADD3_FUNC                 (GPIO_FUNC_12)

    #define SDRAM_ADD4_PORT                 (GPIO_PORT_F)   /* PF04 - EXMC_ADD4 */
    #define SDRAM_ADD4_PIN                  (GPIO_PIN_04)
    #define SDRAM_ADD4_FUNC                 (GPIO_FUNC_12)

    #define SDRAM_ADD5_PORT                 (GPIO_PORT_F)   /* PF05 - EXMC_ADD5 */
    #define SDRAM_ADD5_PIN                  (GPIO_PIN_05)
    #define SDRAM_ADD5_FUNC                 (GPIO_FUNC_12)

