levizh/rt-thread/bsp/hc32/ev_hc32f4a2_lqfp176/board/board_config.h
    #define SDRAM_ADD6_PORT                 (GPIO_PORT_F)   /* PF12 - EXMC_ADD6 */
    #define SDRAM_ADD6_PIN                  (GPIO_PIN_12)
    #define SDRAM_ADD6_FUNC                 (GPIO_FUNC_12)

    #define SDRAM_ADD7_PORT                 (GPIO_PORT_F)   /* PF13 - EXMC_ADD7 */
    #define SDRAM_ADD7_PIN                  (GPIO_PIN_13)
    #define SDRAM_ADD7_FUNC                 (GPIO_FUNC_12)

    #define SDRAM_ADD8_PORT                 (GPIO_PORT_F)   /* PF14 - EXMC_ADD8 */
    #define SDRAM_ADD8_PIN                  (GPIO_PIN_14)
    #define SDRAM_ADD8_FUNC                 (GPIO_FUNC_12)

    #define SDRAM_ADD9_PORT                 (GPIO_PORT_F)   /* PF15 - EXMC_ADD9 */
    #define SDRAM_ADD9_PIN                  (GPIO_PIN_15)
    #define SDRAM_ADD9_FUNC                 (GPIO_FUNC_12)

    #define SDRAM_ADD10_PORT                (GPIO_PORT_G)   /* PG00 - EXMC_ADD10 */
    #define SDRAM_ADD10_PIN                 (GPIO_PIN_00)
    #define SDRAM_ADD10_FUNC                (GPIO_FUNC_12)

    #define SDRAM_ADD11_PORT                (GPIO_PORT_G)   /* PG01 - EXMC_ADD11 */
    #define SDRAM_ADD11_PIN                 (GPIO_PIN_01)
    #define SDRAM_ADD11_FUNC                (GPIO_FUNC_12)

    #define SDRAM_DATA0_PORT                (GPIO_PORT_D)   /* PD14 - EXMC_DATA0 */
    #define SDRAM_DATA0_PIN                 (GPIO_PIN_14)
    #define SDRAM_DATA0_FUNC                (GPIO_FUNC_12)
    #define SDRAM_DATA1_PORT                (GPIO_PORT_D)   /* PD15 - EXMC_DATA1 */
    #define SDRAM_DATA1_PIN                 (GPIO_PIN_15)
    #define SDRAM_DATA1_FUNC                (GPIO_FUNC_12)
    #define SDRAM_DATA2_PORT                (GPIO_PORT_D)   /* PD00 - EXMC_DATA2 */
    #define SDRAM_DATA2_PIN                 (GPIO_PIN_00)
    #define SDRAM_DATA2_FUNC                (GPIO_FUNC_12)
    #define SDRAM_DATA3_PORT                (GPIO_PORT_D)   /* PD01 - EXMC_DATA3 */
    #define SDRAM_DATA3_PIN                 (GPIO_PIN_01)
    #define SDRAM_DATA3_FUNC                (GPIO_FUNC_12)
    #define SDRAM_DATA4_PORT                (GPIO_PORT_E)   /* PE07 - EXMC_DATA4 */
    #define SDRAM_DATA4_PIN                 (GPIO_PIN_07)
    #define SDRAM_DATA4_FUNC                (GPIO_FUNC_12)
    #define SDRAM_DATA5_PORT                (GPIO_PORT_E)   /* PE08 - EXMC_DATA5 */
    #define SDRAM_DATA5_PIN                 (GPIO_PIN_08)
    #define SDRAM_DATA5_FUNC                (GPIO_FUNC_12)
    #define SDRAM_DATA6_PORT                (GPIO_PORT_E)   /* PE09 - EXMC_DATA6 */
    #define SDRAM_DATA6_PIN                 (GPIO_PIN_09)
    #define SDRAM_DATA6_FUNC                (GPIO_FUNC_12)
    #define SDRAM_DATA7_PORT                (GPIO_PORT_E)   /* PE10 - EXMC_DATA7 */
    #define SDRAM_DATA7_PIN                 (GPIO_PIN_10)
    #define SDRAM_DATA7_FUNC                (GPIO_FUNC_12)
    #define SDRAM_DATA8_PORT                (GPIO_PORT_E)   /* PE11 - EXMC_DATA8 */
    #define SDRAM_DATA8_PIN                 (GPIO_PIN_11)
    #define SDRAM_DATA8_FUNC                (GPIO_FUNC_12)
    #define SDRAM_DATA9_PORT                (GPIO_PORT_E)   /* PE12 - EXMC_DATA9 */
    #define SDRAM_DATA9_PIN                 (GPIO_PIN_12)
    #define SDRAM_DATA9_FUNC                (GPIO_FUNC_12)
    #define SDRAM_DATA10_PORT               (GPIO_PORT_E)   /* PE13 - EXMC_DATA10 */
    #define SDRAM_DATA10_PIN                (GPIO_PIN_13)
    #define SDRAM_DATA10_FUNC               (GPIO_FUNC_12)
    #define SDRAM_DATA11_PORT               (GPIO_PORT_E)   /* PE14 - EXMC_DATA11 */
    #define SDRAM_DATA11_PIN                (GPIO_PIN_14)
    #define SDRAM_DATA11_FUNC               (GPIO_FUNC_12)
    #define SDRAM_DATA12_PORT               (GPIO_PORT_E)   /* PE15 - EXMC_DATA12 */
    #define SDRAM_DATA12_PIN                (GPIO_PIN_15)
    #define SDRAM_DATA12_FUNC               (GPIO_FUNC_12)
    #define SDRAM_DATA13_PORT               (GPIO_PORT_D)   /* PD08 - EXMC_DATA13 */
    #define SDRAM_DATA13_PIN                (GPIO_PIN_08)
    #define SDRAM_DATA13_FUNC               (GPIO_FUNC_12)
    #define SDRAM_DATA14_PORT               (GPIO_PORT_D)   /* PD09 - EXMC_DATA14 */
    #define SDRAM_DATA14_PIN                (GPIO_PIN_09)
    #define SDRAM_DATA14_FUNC               (GPIO_FUNC_12)
    #define SDRAM_DATA15_PORT               (GPIO_PORT_D)   /* PD10 - EXMC_DATA15 */
    #define SDRAM_DATA15_PIN                (GPIO_PIN_10)
    #define SDRAM_DATA15_FUNC               (GPIO_FUNC_12)
#endif

/************************ RTC/PM *****************************/
#if defined(BSP_USING_RTC) || defined(RT_USING_PM)
    #if defined(BSP_RTC_USING_XTAL32) || defined(RT_USING_PM)
        #define XTAL32_PORT                     (GPIO_PORT_C)
        #define XTAL32_IN_PIN                   (GPIO_PIN_15)
        #define XTAL32_OUT_PIN                  (GPIO_PIN_14)
    #endif
#endif

#if defined(RT_USING_PWM)
    /***********  PWM_TIMA configure *********/
    #if defined(BSP_USING_PWM_TIMA_1)
        #if defined(BSP_USING_PWM_TIMA_1_CH1)
            #define PWM_TIMA_1_CH1_PORT             (GPIO_PORT_A)
            #define PWM_TIMA_1_CH1_PIN              (GPIO_PIN_08)
            #define PWM_TIMA_1_CH1_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_1_CH2)
            #define PWM_TIMA_1_CH2_PORT             (GPIO_PORT_A)
            #define PWM_TIMA_1_CH2_PIN              (GPIO_PIN_09)
            #define PWM_TIMA_1_CH2_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_1_CH3)
            #define PWM_TIMA_1_CH3_PORT             (GPIO_PORT_A)
            #define PWM_TIMA_1_CH3_PIN              (GPIO_PIN_10)
            #define PWM_TIMA_1_CH3_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_1_CH4)
            #define PWM_TIMA_1_CH4_PORT             (GPIO_PORT_A)
            #define PWM_TIMA_1_CH4_PIN              (GPIO_PIN_11)
            #define PWM_TIMA_1_CH4_PIN_FUNC         (GPIO_FUNC_4)
        #endif
    #endif

    #if defined(BSP_USING_PWM_TIMA_2)
        #if defined(BSP_USING_PWM_TIMA_2_CH1)
            #define PWM_TIMA_2_CH1_PORT             (GPIO_PORT_A)
            #define PWM_TIMA_2_CH1_PIN              (GPIO_PIN_00)
            #define PWM_TIMA_2_CH1_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_2_CH2)
            #define PWM_TIMA_2_CH2_PORT             (GPIO_PORT_A)
            #define PWM_TIMA_2_CH2_PIN              (GPIO_PIN_01)
            #define PWM_TIMA_2_CH2_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_2_CH3)
            #define PWM_TIMA_2_CH3_PORT             (GPIO_PORT_A)
            #define PWM_TIMA_2_CH3_PIN              (GPIO_PIN_02)
            #define PWM_TIMA_2_CH3_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_2_CH4)
            #define PWM_TIMA_2_CH4_PORT             (GPIO_PORT_A)
            #define PWM_TIMA_2_CH4_PIN              (GPIO_PIN_03)
            #define PWM_TIMA_2_CH4_PIN_FUNC         (GPIO_FUNC_4)
        #endif
    #endif

    #if defined(BSP_USING_PWM_TIMA_3)
        #if defined(BSP_USING_PWM_TIMA_3_CH1)
            #define PWM_TIMA_3_CH1_PORT             (GPIO_PORT_E)
            #define PWM_TIMA_3_CH1_PIN              (GPIO_PIN_11)
            #define PWM_TIMA_3_CH1_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_3_CH2)
            #define PWM_TIMA_3_CH2_PORT             (GPIO_PORT_E)
            #define PWM_TIMA_3_CH2_PIN              (GPIO_PIN_12)
            #define PWM_TIMA_3_CH2_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_3_CH3)
            #define PWM_TIMA_3_CH3_PORT             (GPIO_PORT_E)
            #define PWM_TIMA_3_CH3_PIN              (GPIO_PIN_13)
            #define PWM_TIMA_3_CH3_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_3_CH4)
            #define PWM_TIMA_3_CH4_PORT             (GPIO_PORT_E)
            #define PWM_TIMA_3_CH4_PIN              (GPIO_PIN_14)
            #define PWM_TIMA_3_CH4_PIN_FUNC         (GPIO_FUNC_5)
        #endif
    #endif

    #if defined(BSP_USING_PWM_TIMA_4)
        #if defined(BSP_USING_PWM_TIMA_4_CH1)
            #define PWM_TIMA_4_CH1_PORT             (GPIO_PORT_F)
            #define PWM_TIMA_4_CH1_PIN              (GPIO_PIN_11)
            #define PWM_TIMA_4_CH1_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_4_CH2)
            #define PWM_TIMA_4_CH2_PORT             (GPIO_PORT_F)
            #define PWM_TIMA_4_CH2_PIN              (GPIO_PIN_12)
            #define PWM_TIMA_4_CH2_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_4_CH3)
            #define PWM_TIMA_4_CH3_PORT             (GPIO_PORT_F)
            #define PWM_TIMA_4_CH3_PIN              (GPIO_PIN_13)
            #define PWM_TIMA_4_CH3_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_4_CH4)
            #define PWM_TIMA_4_CH4_PORT             (GPIO_PORT_F)
            #define PWM_TIMA_4_CH4_PIN              (GPIO_PIN_14)
            #define PWM_TIMA_4_CH4_PIN_FUNC         (GPIO_FUNC_4)
        #endif
    #endif

    #if defined(BSP_USING_PWM_TIMA_5)
        #if defined(BSP_USING_PWM_TIMA_5_CH1)
            #define PWM_TIMA_5_CH1_PORT             (GPIO_PORT_H)
            #define PWM_TIMA_5_CH1_PIN              (GPIO_PIN_10)
            #define PWM_TIMA_5_CH1_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_5_CH2)
            #define PWM_TIMA_5_CH2_PORT             (GPIO_PORT_H)
            #define PWM_TIMA_5_CH2_PIN              (GPIO_PIN_11)
            #define PWM_TIMA_5_CH2_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_5_CH3)
            #define PWM_TIMA_5_CH3_PORT             (GPIO_PORT_H)
            #define PWM_TIMA_5_CH3_PIN              (GPIO_PIN_12)
            #define PWM_TIMA_5_CH3_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_5_CH4)
            #define PWM_TIMA_5_CH4_PORT             (GPIO_PORT_H)
            #define PWM_TIMA_5_CH4_PIN              (GPIO_PIN_01)
            #define PWM_TIMA_5_CH4_PIN_FUNC         (GPIO_FUNC_5)
        #endif
    #endif

