levizh/rt-thread/bsp/hc32/ev_hc32f4a2_lqfp176/board/board_config.h
    #if defined(BSP_USING_PWM_TIMA_6)
        #if defined(BSP_USING_PWM_TIMA_6_CH1)
            #define PWM_TIMA_6_CH1_PORT             (GPIO_PORT_D)
            #define PWM_TIMA_6_CH1_PIN              (GPIO_PIN_08)
            #define PWM_TIMA_6_CH1_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_6_CH2)
            #define PWM_TIMA_6_CH2_PORT             (GPIO_PORT_D)
            #define PWM_TIMA_6_CH2_PIN              (GPIO_PIN_09)
            #define PWM_TIMA_6_CH2_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_6_CH3)
            #define PWM_TIMA_6_CH3_PORT             (GPIO_PORT_D)
            #define PWM_TIMA_6_CH3_PIN              (GPIO_PIN_10)
            #define PWM_TIMA_6_CH3_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_6_CH4)
            #define PWM_TIMA_6_CH4_PORT             (GPIO_PORT_D)
            #define PWM_TIMA_6_CH4_PIN              (GPIO_PIN_11)
            #define PWM_TIMA_6_CH4_PIN_FUNC         (GPIO_FUNC_5)
        #endif
    #endif

    #if defined(BSP_USING_PWM_TIMA_7)
        #if defined(BSP_USING_PWM_TIMA_7_CH1)
            #define PWM_TIMA_7_CH1_PORT             (GPIO_PORT_B)
            #define PWM_TIMA_7_CH1_PIN              (GPIO_PIN_13)
            #define PWM_TIMA_7_CH1_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_7_CH2)
            #define PWM_TIMA_7_CH2_PORT             (GPIO_PORT_B)
            #define PWM_TIMA_7_CH2_PIN              (GPIO_PIN_14)
            #define PWM_TIMA_7_CH2_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_7_CH3)
            #define PWM_TIMA_7_CH3_PORT             (GPIO_PORT_B)
            #define PWM_TIMA_7_CH3_PIN              (GPIO_PIN_15)
            #define PWM_TIMA_7_CH3_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_7_CH4)
            #define PWM_TIMA_7_CH4_PORT             (GPIO_PORT_B)
            #define PWM_TIMA_7_CH4_PIN              (GPIO_PIN_12)
            #define PWM_TIMA_7_CH4_PIN_FUNC         (GPIO_FUNC_4)
        #endif
    #endif

    #if defined(BSP_USING_PWM_TIMA_8)
        #if defined(BSP_USING_PWM_TIMA_8_CH1)
            #define PWM_TIMA_8_CH1_PORT             (GPIO_PORT_G)
            #define PWM_TIMA_8_CH1_PIN              (GPIO_PIN_11)
            #define PWM_TIMA_8_CH1_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_8_CH2)
            #define PWM_TIMA_8_CH2_PORT             (GPIO_PORT_G)
            #define PWM_TIMA_8_CH2_PIN              (GPIO_PIN_12)
            #define PWM_TIMA_8_CH2_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_8_CH3)
            #define PWM_TIMA_8_CH3_PORT             (GPIO_PORT_G)
            #define PWM_TIMA_8_CH3_PIN              (GPIO_PIN_13)
            #define PWM_TIMA_8_CH3_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_8_CH4)
            #define PWM_TIMA_8_CH4_PORT             (GPIO_PORT_G)
            #define PWM_TIMA_8_CH4_PIN              (GPIO_PIN_14)
            #define PWM_TIMA_8_CH4_PIN_FUNC         (GPIO_FUNC_4)
        #endif
    #endif

    #if defined(BSP_USING_PWM_TIMA_9)
        #if defined(BSP_USING_PWM_TIMA_9_CH1)
            #define PWM_TIMA_9_CH1_PORT             (GPIO_PORT_E)
            #define PWM_TIMA_9_CH1_PIN              (GPIO_PIN_02)
            #define PWM_TIMA_9_CH1_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_9_CH2)
            #define PWM_TIMA_9_CH2_PORT             (GPIO_PORT_E)
            #define PWM_TIMA_9_CH2_PIN              (GPIO_PIN_03)
            #define PWM_TIMA_9_CH2_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_9_CH3)
            #define PWM_TIMA_9_CH3_PORT             (GPIO_PORT_E)
            #define PWM_TIMA_9_CH3_PIN              (GPIO_PIN_04)
            #define PWM_TIMA_9_CH3_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_9_CH4)
            #define PWM_TIMA_9_CH4_PORT             (GPIO_PORT_E)
            #define PWM_TIMA_9_CH4_PIN              (GPIO_PIN_05)
            #define PWM_TIMA_9_CH4_PIN_FUNC         (GPIO_FUNC_4)
        #endif
    #endif

    #if defined(BSP_USING_PWM_TIMA_10)
        #if defined(BSP_USING_PWM_TIMA_10_CH1)
            #define PWM_TIMA_10_CH1_PORT             (GPIO_PORT_F)
            #define PWM_TIMA_10_CH1_PIN              (GPIO_PIN_06)
            #define PWM_TIMA_10_CH1_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_10_CH2)
            #define PWM_TIMA_10_CH2_PORT             (GPIO_PORT_F)
            #define PWM_TIMA_10_CH2_PIN              (GPIO_PIN_07)
            #define PWM_TIMA_10_CH2_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_10_CH3)
            #define PWM_TIMA_10_CH3_PORT             (GPIO_PORT_F)
            #define PWM_TIMA_10_CH3_PIN              (GPIO_PIN_08)
            #define PWM_TIMA_10_CH3_PIN_FUNC         (GPIO_FUNC_4)
        #endif
        #if defined(BSP_USING_PWM_TIMA_10_CH4)
            #define PWM_TIMA_10_CH4_PORT             (GPIO_PORT_F)
            #define PWM_TIMA_10_CH4_PIN              (GPIO_PIN_09)
            #define PWM_TIMA_10_CH4_PIN_FUNC         (GPIO_FUNC_4)
        #endif
    #endif

    #if defined(BSP_USING_PWM_TIMA_11)
        #if defined(BSP_USING_PWM_TIMA_11_CH1)
            #define PWM_TIMA_11_CH1_PORT             (GPIO_PORT_F)
            #define PWM_TIMA_11_CH1_PIN              (GPIO_PIN_00)
            #define PWM_TIMA_11_CH1_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_11_CH2)
            #define PWM_TIMA_11_CH2_PORT             (GPIO_PORT_F)
            #define PWM_TIMA_11_CH2_PIN              (GPIO_PIN_01)
            #define PWM_TIMA_11_CH2_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_11_CH3)
            #define PWM_TIMA_11_CH3_PORT             (GPIO_PORT_F)
            #define PWM_TIMA_11_CH3_PIN              (GPIO_PIN_02)
            #define PWM_TIMA_11_CH3_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_11_CH4)
            #define PWM_TIMA_11_CH4_PORT             (GPIO_PORT_F)
            #define PWM_TIMA_11_CH4_PIN              (GPIO_PIN_03)
            #define PWM_TIMA_11_CH4_PIN_FUNC         (GPIO_FUNC_5)
        #endif
    #endif

    #if defined(BSP_USING_PWM_TIMA_12)
        #if defined(BSP_USING_PWM_TIMA_12_CH1)
            #define PWM_TIMA_12_CH1_PORT             (GPIO_PORT_D)
            #define PWM_TIMA_12_CH1_PIN              (GPIO_PIN_01)
            #define PWM_TIMA_12_CH1_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_12_CH2)
            #define PWM_TIMA_12_CH2_PORT             (GPIO_PORT_D)
            #define PWM_TIMA_12_CH2_PIN              (GPIO_PIN_02)
            #define PWM_TIMA_12_CH2_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_12_CH3)
            #define PWM_TIMA_12_CH3_PORT             (GPIO_PORT_D)
            #define PWM_TIMA_12_CH3_PIN              (GPIO_PIN_03)
            #define PWM_TIMA_12_CH3_PIN_FUNC         (GPIO_FUNC_5)
        #endif
        #if defined(BSP_USING_PWM_TIMA_12_CH4)
            #define PWM_TIMA_12_CH4_PORT             (GPIO_PORT_D)
            #define PWM_TIMA_12_CH4_PIN              (GPIO_PIN_04)
            #define PWM_TIMA_12_CH4_PIN_FUNC         (GPIO_FUNC_5)
        #endif
    #endif

    /***********  PWM_TIM4 configure *********/
    #if defined(BSP_USING_PWM_TIM4_1)
        #if defined(BSP_USING_PWM_TIM4_1_OUH)
            #define PWM_TIM4_1_OUH_PORT             (GPIO_PORT_E)
            #define PWM_TIM4_1_OUH_PIN              (GPIO_PIN_09)
            #define PWM_TIM4_1_OUH_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_1_OUL)
            #define PWM_TIM4_1_OUL_PORT             (GPIO_PORT_E)
            #define PWM_TIM4_1_OUL_PIN              (GPIO_PIN_08)
            #define PWM_TIM4_1_OUL_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_1_OVH)
            #define PWM_TIM4_1_OVH_PORT             (GPIO_PORT_E)
            #define PWM_TIM4_1_OVH_PIN              (GPIO_PIN_11)
            #define PWM_TIM4_1_OVH_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_1_OVL)
            #define PWM_TIM4_1_OVL_PORT             (GPIO_PORT_E)
            #define PWM_TIM4_1_OVL_PIN              (GPIO_PIN_10)
            #define PWM_TIM4_1_OVL_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_1_OWH)
            #define PWM_TIM4_1_OWH_PORT             (GPIO_PORT_E)
            #define PWM_TIM4_1_OWH_PIN              (GPIO_PIN_13)
            #define PWM_TIM4_1_OWH_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_1_OWL)
            #define PWM_TIM4_1_OWL_PORT             (GPIO_PORT_E)
            #define PWM_TIM4_1_OWL_PIN              (GPIO_PIN_12)
            #define PWM_TIM4_1_OWL_PIN_FUNC         (GPIO_FUNC_2)
        #endif
    #endif
    #if defined(BSP_USING_PWM_TIM4_2)
        #if defined(BSP_USING_PWM_TIM4_2_OUH)
            #define PWM_TIM4_2_OUH_PORT             (GPIO_PORT_A)
            #define PWM_TIM4_2_OUH_PIN              (GPIO_PIN_00)
            #define PWM_TIM4_2_OUH_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_2_OUL)
            #define PWM_TIM4_2_OUL_PORT             (GPIO_PORT_A)
            #define PWM_TIM4_2_OUL_PIN              (GPIO_PIN_01)
            #define PWM_TIM4_2_OUL_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_2_OVH)
            #define PWM_TIM4_2_OVH_PORT             (GPIO_PORT_A)
            #define PWM_TIM4_2_OVH_PIN              (GPIO_PIN_02)
            #define PWM_TIM4_2_OVH_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_2_OVL)
            #define PWM_TIM4_2_OVL_PORT             (GPIO_PORT_A)
            #define PWM_TIM4_2_OVL_PIN              (GPIO_PIN_03)
            #define PWM_TIM4_2_OVL_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_2_OWH)
            #define PWM_TIM4_2_OWH_PORT             (GPIO_PORT_A)
            #define PWM_TIM4_2_OWH_PIN              (GPIO_PIN_04)
            #define PWM_TIM4_2_OWH_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_2_OWL)
            #define PWM_TIM4_2_OWL_PORT             (GPIO_PORT_A)
            #define PWM_TIM4_2_OWL_PIN              (GPIO_PIN_05)
            #define PWM_TIM4_2_OWL_PIN_FUNC         (GPIO_FUNC_2)
        #endif
    #endif
    #if defined(BSP_USING_PWM_TIM4_3)
        #if defined(BSP_USING_PWM_TIM4_3_OUH)
            #define PWM_TIM4_3_OUH_PORT             (GPIO_PORT_C)
            #define PWM_TIM4_3_OUH_PIN              (GPIO_PIN_10)
            #define PWM_TIM4_3_OUH_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_3_OUL)
            #define PWM_TIM4_3_OUL_PORT             (GPIO_PORT_D)
            #define PWM_TIM4_3_OUL_PIN              (GPIO_PIN_00)
            #define PWM_TIM4_3_OUL_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_3_OVH)
            #define PWM_TIM4_3_OVH_PORT             (GPIO_PORT_C)
            #define PWM_TIM4_3_OVH_PIN              (GPIO_PIN_11)
            #define PWM_TIM4_3_OVH_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_3_OVL)
            #define PWM_TIM4_3_OVL_PORT             (GPIO_PORT_D)
            #define PWM_TIM4_3_OVL_PIN              (GPIO_PIN_01)
            #define PWM_TIM4_3_OVL_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_3_OWH)
            #define PWM_TIM4_3_OWH_PORT             (GPIO_PORT_C)
            #define PWM_TIM4_3_OWH_PIN              (GPIO_PIN_12)
            #define PWM_TIM4_3_OWH_PIN_FUNC         (GPIO_FUNC_2)
        #endif
        #if defined(BSP_USING_PWM_TIM4_3_OWL)
            #define PWM_TIM4_3_OWL_PORT             (GPIO_PORT_D)
            #define PWM_TIM4_3_OWL_PIN              (GPIO_PIN_02)
            #define PWM_TIM4_3_OWL_PIN_FUNC         (GPIO_FUNC_2)
        #endif
    #endif

    /***********  PWM_TIM6 configure *********/
    #if defined(BSP_USING_PWM_TIM6_1)
        #if defined(BSP_USING_PWM_TIM6_1_A)
            #define PWM_TIM6_1_A_PORT               (GPIO_PORT_F)
            #define PWM_TIM6_1_A_PIN                (GPIO_PIN_13)
            #define PWM_TIM6_1_A_PIN_FUNC           (GPIO_FUNC_3)
        #endif
        #if defined(BSP_USING_PWM_TIM6_1_B)
            #define PWM_TIM6_1_B_PORT               (GPIO_PORT_F)
            #define PWM_TIM6_1_B_PIN                (GPIO_PIN_14)
            #define PWM_TIM6_1_B_PIN_FUNC           (GPIO_FUNC_3)
        #endif
    #endif
    #if defined(BSP_USING_PWM_TIM6_2)
        #if defined(BSP_USING_PWM_TIM6_2_A)
            #define PWM_TIM6_2_A_PORT               (GPIO_PORT_E)
            #define PWM_TIM6_2_A_PIN                (GPIO_PIN_11)
            #define PWM_TIM6_2_A_PIN_FUNC           (GPIO_FUNC_3)
        #endif
        #if defined(BSP_USING_PWM_TIM6_2_B)
            #define PWM_TIM6_2_B_PORT               (GPIO_PORT_E)
            #define PWM_TIM6_2_B_PIN                (GPIO_PIN_10)
            #define PWM_TIM6_2_B_PIN_FUNC           (GPIO_FUNC_3)
        #endif
    #endif
    #if defined(BSP_USING_PWM_TIM6_3)
        #if defined(BSP_USING_PWM_TIM6_3_A)
            #define PWM_TIM6_3_A_PORT               (GPIO_PORT_E)
            #define PWM_TIM6_3_A_PIN                (GPIO_PIN_13)
            #define PWM_TIM6_3_A_PIN_FUNC           (GPIO_FUNC_3)
        #endif
        #if defined(BSP_USING_PWM_TIM6_3_B)
            #define PWM_TIM6_3_B_PORT               (GPIO_PORT_E)
            #define PWM_TIM6_3_B_PIN                (GPIO_PIN_12)
            #define PWM_TIM6_3_B_PIN_FUNC           (GPIO_FUNC_3)
        #endif
    #endif
    #if defined(BSP_USING_PWM_TIM6_4)
        #if defined(BSP_USING_PWM_TIM6_4_A)
            #define PWM_TIM6_4_A_PORT               (GPIO_PORT_A)
            #define PWM_TIM6_4_A_PIN                (GPIO_PIN_11)
            #define PWM_TIM6_4_A_PIN_FUNC           (GPIO_FUNC_3)
        #endif
        #if defined(BSP_USING_PWM_TIM6_4_B)
            #define PWM_TIM6_4_B_PORT               (GPIO_PORT_G)
            #define PWM_TIM6_4_B_PIN                (GPIO_PIN_14)
            #define PWM_TIM6_4_B_PIN_FUNC           (GPIO_FUNC_3)
        #endif
    #endif
    #if defined(BSP_USING_PWM_TIM6_5)
        #if defined(BSP_USING_PWM_TIM6_5_A)
            #define PWM_TIM6_5_A_PORT               (GPIO_PORT_C)
            #define PWM_TIM6_5_A_PIN                (GPIO_PIN_04)
            #define PWM_TIM6_5_A_PIN_FUNC           (GPIO_FUNC_3)
        #endif
        #if defined(BSP_USING_PWM_TIM6_5_B)
            #define PWM_TIM6_5_B_PORT               (GPIO_PORT_C)
            #define PWM_TIM6_5_B_PIN                (GPIO_PIN_05)
            #define PWM_TIM6_5_B_PIN_FUNC           (GPIO_FUNC_3)
        #endif
    #endif
    #if defined(BSP_USING_PWM_TIM6_6)
        #if defined(BSP_USING_PWM_TIM6_6_A)
            #define PWM_TIM6_6_A_PORT               (GPIO_PORT_A)
            #define PWM_TIM6_6_A_PIN                (GPIO_PIN_02)
            #define PWM_TIM6_6_A_PIN_FUNC           (GPIO_FUNC_3)
        #endif
        #if defined(BSP_USING_PWM_TIM6_6_B)
            #define PWM_TIM6_6_B_PORT               (GPIO_PORT_A)
            #define PWM_TIM6_6_B_PIN                (GPIO_PIN_03)
            #define PWM_TIM6_6_B_PIN_FUNC           (GPIO_FUNC_3)
        #endif
    #endif
    #if defined(BSP_USING_PWM_TIM6_7)
        #if defined(BSP_USING_PWM_TIM6_7_A)
            #define PWM_TIM6_7_A_PORT               (GPIO_PORT_A)
            #define PWM_TIM6_7_A_PIN                (GPIO_PIN_04)
            #define PWM_TIM6_7_A_PIN_FUNC           (GPIO_FUNC_3)
        #endif
        #if defined(BSP_USING_PWM_TIM6_7_B)
            #define PWM_TIM6_7_B_PORT               (GPIO_PORT_A)
            #define PWM_TIM6_7_B_PIN                (GPIO_PIN_05)
            #define PWM_TIM6_7_B_PIN_FUNC           (GPIO_FUNC_3)
        #endif
    #endif
    #if defined(BSP_USING_PWM_TIM6_8)
        #if defined(BSP_USING_PWM_TIM6_8_A)
            #define PWM_TIM6_8_A_PORT               (GPIO_PORT_C)
            #define PWM_TIM6_8_A_PIN                (GPIO_PIN_08)
            #define PWM_TIM6_8_A_PIN_FUNC           (GPIO_FUNC_3)
        #endif
        #if defined(BSP_USING_PWM_TIM6_8_B)
            #define PWM_TIM6_8_B_PORT               (GPIO_PORT_C)
            #define PWM_TIM6_8_B_PIN                (GPIO_PIN_09)
            #define PWM_TIM6_8_B_PIN_FUNC           (GPIO_FUNC_3)
        #endif
    #endif

#endif

#if defined(BSP_USING_USBD) || defined(BSP_USING_USBH)
    #if defined(BSP_USING_USBFS)
        /* USBFS Core*/
        #define USBF_DP_PORT                    (GPIO_PORT_A)
        #define USBF_DP_PIN                     (GPIO_PIN_12)
        #define USBF_DP_FUNC                    (GPIO_FUNC_10)
        #define USBF_DM_PORT                    (GPIO_PORT_A)
        #define USBF_DM_PIN                     (GPIO_PIN_11)
        #define USBF_DM_FUNC                    (GPIO_FUNC_10)
        #define USBF_VBUS_PORT                  (GPIO_PORT_A)
        #define USBF_VBUS_PIN                   (GPIO_PIN_09)
        #define USBF_VBUS_FUNC                  (GPIO_FUNC_10)
        #define USBF_DRVVBUS_PORT               (GPIO_PORT_C)
        #define USBF_DRVVBUS_PIN                (GPIO_PIN_09)
        #define USBF_DRVVBUS_FUNC               (GPIO_FUNC_10)
    #elif defined(BSP_USING_USBHS)
        /* USBHS Core*/
        #if defined(BSP_USING_USBHS_PHY_EMBED)
            #define USBH_DP_PORT                    (GPIO_PORT_B)
            #define USBH_DP_PIN                     (GPIO_PIN_15)
            #define USBH_DP_FUNC                    (GPIO_FUNC_10)
            #define USBH_DM_PORT                    (GPIO_PORT_B)
            #define USBH_DM_PIN                     (GPIO_PIN_14)
            #define USBH_DM_FUNC                    (GPIO_FUNC_10)
            #define USBH_VBUS_PORT                  (GPIO_PORT_B)
            #define USBH_VBUS_PIN                   (GPIO_PIN_13)
            #define USBH_VBUS_FUNC                  (GPIO_FUNC_12)
            #define USBH_DRVVBUS_PORT               (GPIO_PORT_B)
            #define USBH_DRVVBUS_PIN                (GPIO_PIN_11)
            #define USBH_DRVVBUS_FUNC               (GPIO_FUNC_10)
        #else
            /* USBHS Core, external PHY */
            #define USBH_ULPI_CLK_PORT              (GPIO_PORT_E)
            #define USBH_ULPI_CLK_PIN               (GPIO_PIN_12)
            #define USBH_ULPI_CLK_FUNC              (GPIO_FUNC_10)
            #define USBH_ULPI_DIR_PORT              (GPIO_PORT_C)
            #define USBH_ULPI_DIR_PIN               (GPIO_PIN_02)
            #define USBH_ULPI_DIR_FUNC              (GPIO_FUNC_10)
            #define USBH_ULPI_NXT_PORT              (GPIO_PORT_C)
            #define USBH_ULPI_NXT_PIN               (GPIO_PIN_03)
            #define USBH_ULPI_NXT_FUNC              (GPIO_FUNC_10)
            #define USBH_ULPI_STP_PORT              (GPIO_PORT_C)
            #define USBH_ULPI_STP_PIN               (GPIO_PIN_00)
            #define USBH_ULPI_STP_FUNC              (GPIO_FUNC_10)
            #define USBH_ULPI_D0_PORT               (GPIO_PORT_E)
            #define USBH_ULPI_D0_PIN                (GPIO_PIN_13)
            #define USBH_ULPI_D0_FUNC               (GPIO_FUNC_10)
            #define USBH_ULPI_D1_PORT               (GPIO_PORT_E)
            #define USBH_ULPI_D1_PIN                (GPIO_PIN_14)
            #define USBH_ULPI_D1_FUNC               (GPIO_FUNC_10)
            #define USBH_ULPI_D2_PORT               (GPIO_PORT_E)
            #define USBH_ULPI_D2_PIN                (GPIO_PIN_15)
            #define USBH_ULPI_D2_FUNC               (GPIO_FUNC_10)
            #define USBH_ULPI_D3_PORT               (GPIO_PORT_B)
            #define USBH_ULPI_D3_PIN                (GPIO_PIN_10)
            #define USBH_ULPI_D3_FUNC               (GPIO_FUNC_10)
            #define USBH_ULPI_D4_PORT               (GPIO_PORT_B)
            #define USBH_ULPI_D4_PIN                (GPIO_PIN_11)
            #define USBH_ULPI_D4_FUNC               (GPIO_FUNC_10)
            #define USBH_ULPI_D5_PORT               (GPIO_PORT_B)
            #define USBH_ULPI_D5_PIN                (GPIO_PIN_12)
            #define USBH_ULPI_D5_FUNC               (GPIO_FUNC_10)
            #define USBH_ULPI_D6_PORT               (GPIO_PORT_B)
            #define USBH_ULPI_D6_PIN                (GPIO_PIN_13)
            #define USBH_ULPI_D6_FUNC               (GPIO_FUNC_10)
            #define USBH_ULPI_D7_PORT               (GPIO_PORT_E)
            #define USBH_ULPI_D7_PIN                (GPIO_PIN_11)
            #define USBH_ULPI_D7_FUNC               (GPIO_FUNC_10)
            /* 3300 reset */
            #define USB_3300_RESET_PORT             (EIO_PORT1)
            #define USB_3300_RESET_PIN              (EIO_USB3300_RST)
        #endif
    #endif
#endif

#if defined(BSP_USING_QSPI)
    #ifndef BSP_QSPI_USING_SOFT_CS
        /* QSSN */
        #define QSPI_FLASH_CS_PORT              (GPIO_PORT_C)
        #define QSPI_FLASH_CS_PIN               (GPIO_PIN_07)
        #define QSPI_FLASH_CS_FUNC              (GPIO_FUNC_18)
    #endif
    /* QSCK */
    #define QSPI_FLASH_SCK_PORT             (GPIO_PORT_C)
    #define QSPI_FLASH_SCK_PIN              (GPIO_PIN_06)
    #define QSPI_FLASH_SCK_FUNC             (GPIO_FUNC_18)
    /* QSIO0 */
    #define QSPI_FLASH_IO0_PORT             (GPIO_PORT_B)
    #define QSPI_FLASH_IO0_PIN              (GPIO_PIN_13)
    #define QSPI_FLASH_IO0_FUNC             (GPIO_FUNC_18)
    /* QSIO1 */
    #define QSPI_FLASH_IO1_PORT             (GPIO_PORT_B)
    #define QSPI_FLASH_IO1_PIN              (GPIO_PIN_12)
    #define QSPI_FLASH_IO1_FUNC             (GPIO_FUNC_18)
    /* QSIO2 */
    #define QSPI_FLASH_IO2_PORT             (GPIO_PORT_B)
    #define QSPI_FLASH_IO2_PIN              (GPIO_PIN_10)
    #define QSPI_FLASH_IO2_FUNC             (GPIO_FUNC_18)
    /* QSIO3 */
    #define QSPI_FLASH_IO3_PORT             (GPIO_PORT_B)
    #define QSPI_FLASH_IO3_PIN              (GPIO_PIN_02)
    #define QSPI_FLASH_IO3_FUNC             (GPIO_FUNC_18)
#endif


#endif
